Autodesk.Revit.DB.IExternalDBApplication.OnShutdown(Autodesk.Revit.ApplicationServices.ControlledApplication)
Implement this method to execute some tasks when Autodesk Revit shuts down.
application:  Handle to the Revit Application object.
Returns: Indicates if the external db application completes its work successfully.

Autodesk.Revit.DB.IExternalDBApplication.OnStartup(Autodesk.Revit.ApplicationServices.ControlledApplication)
Implement this method to execute some tasks when Autodesk Revit starts.
application:  Handle to the Revit Application object.
Remarks: Typically, event handlers and updaters are registered in this method.
Returns: Indicates if the external db application completes its work successfully.

Autodesk.Revit.DB.IExternalDBApplication
An interface that supports addition of DB-level external applications to Revit, to subscribe to DB-level events and updaters.
Remarks: DB-level applications are permitted to add DB-level events and updaters to the session.
They cannot create or modify UI.